
#include "ledmon.h"
#include "led.h"

/* ------------------------------------------------------------------------------------------- *
 *  мониторный светодиод (отображение режима и ошибок)
 * ------------------------------------------------------------------------------------------- */

static const ledarr_t sigall[] = {
    { 0b10101010, 0b10101010, 0b10101010, 0b10101010, 0b10101010, 0b10101010, 0b10101010, 0b10101010 },
    { 0b11111111, 0b11111111, 0b11111111, 0b11111111, 0b11111111, 0b11111111, 0b11111111, 0b11111111 },
    { 0b00000000, 0b00000000, 0b00111000 },
    { 0b11100000 },
    { 0b11100011, 0b10000000 },
    { 0b11100011, 0b10001110 },
    { 0b11100011, 0b10001110, 0b00111000 },
    { 0b11100011, 0b10001110, 0b00111000, 0b11100011, 0b10000000 },
    { 0b11100000, 0b00001110, 0b00111000 },
};
static int sigcurr = 0;

void ledMonForce(bool ison) {
    ledForce(LED_MONITOR, ison);
}


void ledMonSet(int signum) {
    sigcurr = signum;
    ledSet(LED_MONITOR, (sigcurr > 0) && (sigcurr <= (sizeof(sigall)/sizeof(sigall[0]))) ? sigall[sigcurr-1] : NULL);
}
